src/DataProcessors/АБ_РазовогоПримененияПослеПереноса_ПроставитьРегистрациюВНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АБ_РазовогоПримененияПослеПереноса_ПроставитьРегистрациюВНО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрацияНеВерная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВерная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/АБ_РазовогоПримененияПослеПереноса_ПроставитьРегистрациюВНО/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаменитьНаСервере()
	
//Учет доходов

Запрос=Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор
               |ИЗ
               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
               |ГДЕ
               |	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
Запрос.УстановитьПараметр("Период",Объект.Период);
Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	НаборЗаписейСведенияОДоходах = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписейСведенияОДоходах.Отбор.Регистратор.Установить(Результат.Регистратор);
	НаборЗаписейСведенияОДоходах.Прочитать();
	ПромежуточнаяТабЗначений=НаборЗаписейСведенияОДоходах.Выгрузить();
	БылиИзменения=Ложь;
	Для Каждого Строка Из ПромежуточнаяТабЗначений Цикл
		Если Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияНеВерная Тогда
			Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияВерная;
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	Если БылиИзменения Тогда
		НаборЗаписейСведенияОДоходах.Загрузить(ПромежуточнаяТабЗначений);
		Попытка
			НаборЗаписейСведенияОДоходах.Записать();
		Исключение
			Сообщить("Не удалось записать документ: " + Результат.Регистратор);
		КонецПопытки;
	КонецЕсли;
КонецЦикла;

//Расчеты налогоплательщиков с бюджетом по НДФЛ
Запрос=Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор
               |ИЗ
               |	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
               |ГДЕ
               |	НАЧАЛОПЕРИОДА(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
Запрос.УстановитьПараметр("Период",Объект.Период);
Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	НаборЗаписейРасчетыНалогоплательщиков = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыНалогоплательщиков.Отбор.Регистратор.Установить(Результат.Регистратор);
	НаборЗаписейРасчетыНалогоплательщиков.Прочитать();
	ПромежуточнаяТабЗначений=НаборЗаписейРасчетыНалогоплательщиков.Выгрузить();
	БылиИзменения=Ложь;
	Для Каждого Строка Из ПромежуточнаяТабЗначений Цикл
		Если Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияНеВерная Тогда
			Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияВерная;
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	Если БылиИзменения Тогда
		НаборЗаписейРасчетыНалогоплательщиков.Загрузить(ПромежуточнаяТабЗначений);
		Попытка
			НаборЗаписейРасчетыНалогоплательщиков.Записать();
		Исключение
			Сообщить("Не удалось записать документ: " + Результат.Регистратор);
		КонецПопытки;
	КонецЕсли;
КонецЦикла;

//Расчеты Налоговых агентов
Запрос=Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Регистратор
               |ИЗ
               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
               |ГДЕ
               |	НАЧАЛОПЕРИОДА(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
Запрос.УстановитьПараметр("Период",Объект.Период);
Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	НаборЗаписейРасчетыНалоговыхАгентов = РегистрыНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыНалоговыхАгентов.Отбор.Регистратор.Установить(Результат.Регистратор);
	НаборЗаписейРасчетыНалоговыхАгентов.Прочитать();
	ПромежуточнаяТабЗначений=НаборЗаписейРасчетыНалоговыхАгентов.Выгрузить();
	БылиИзменения=Ложь;
	Для Каждого Строка Из ПромежуточнаяТабЗначений Цикл
		Если Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияНеВерная Тогда
			Строка.РегистрацияВНалоговомОргане = Объект.РегистрацияВерная;
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	Если БылиИзменения Тогда
		НаборЗаписейРасчетыНалоговыхАгентов.Загрузить(ПромежуточнаяТабЗначений);
		Попытка
			НаборЗаписейРасчетыНалоговыхАгентов.Записать();
		Исключение
			Сообщить("Не удалось записать документ: " + Результат.Регистратор);
		КонецПопытки;
	КонецЕсли;
КонецЦикла;

Сообщить("Обработка завершена");

	
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	ЗаменитьНаСервере();
КонецПроцедуры
